#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	int x, y, a, b, c;

	bool rez = false;

	cout << "Введите размеры отверстия: " << endl;
	cout << "Ширина: ";
	cin >> x;

	cout << "Высота: ";
	cin >> y;

	cout << "Введите параметры кирпича: " << endl;
	cout << "Длинна: ";
	cin >> a;

	cout << "Высота: ";
	cin >> b;

	cout << "Ширина: ";
	cin >> c;

	if (a < b || a < c)
	{
		cout << "НЕ верно заданы параметры кирпича :) , длинна должна быть самым большим параметром! " << endl;
	}
	else
	{
		if (c <= x && b <= y)
		{
			rez = true;
		}
		else if (c <= y && b <= x)
		{
			rez = true;
		}


		if (rez)
		{
			cout << "Кирпич влез в отверстие!" << endl;
		}
		else
		{
			cout << "Кирпич НЕ влез в отверстие!" << endl;
		}
	}
	
	system("pause");

	return 0;
}
